In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.4.2'

# Series

In [4]:
list_1 = [1,2,-3,6,5,'data values']
print(list_1)

[1, 2, -3, 6, 5, 'data values']

In [5]:
Series_1=pd.Series(list_1)
Series_1

0              1
1              2
2             -3
3              6
4              5
5    data values
dtype: object

In [6]:
Series_2 = pd.Series([1,2,3,4])
Series_2

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
import warnings
warnings.filterwarnings("ignore")
empty_1 = pd.Series([])
empty_1

Series([], dtype: float64)

In [8]:
Series_3 = pd.Series([1,2,3,4],index = ['a','b','c','d'])
Series_3

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
Series_3 = pd.Series([1,2,3,4],index = ['a','b','c','d'],dtype=float)
Series_3

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [10]:
Scalar_1= pd.Series(0.5)
Scalar_1

0    0.5
dtype: float64

In [11]:
Scalar_1= pd.Series(0.5,index=[1,2,3])
Scalar_1

1    0.5
2    0.5
3    0.5
dtype: float64

In [12]:
dict_1 = pd.Series({'a':1,'b':2})
dict_1

a    1
b    2
dtype: int64

In [13]:
Series_4 = pd.Series([7,18,30,98,201])
Series_4

0      7
1     18
2     30
3     98
4    201
dtype: int64

In [14]:
Series_4[3]

98

In [15]:
Series_4[0:3]

0     7
1    18
2    30
dtype: int64

In [16]:
min(Series_4)

7

In [17]:
max(Series_4)

201

In [18]:
Series_4[Series_4>25]

2     30
3     98
4    201
dtype: int64

In [19]:
Series_5 = ([19,25,30,78,89])
Series_5

[19, 25, 30, 78, 89]

In [20]:
Series_6 = Series_4 + Series_5
Series_6

0     26
1     43
2     60
3    176
4    290
dtype: int64

In [21]:
Series_7 = pd.Series([8,18,41])
Series_6 + Series_7

0     34.0
1     61.0
2    101.0
3      NaN
4      NaN
dtype: float64

# Dataframe

In [22]:
import pandas as pd

In [23]:
emt_df = pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

In [24]:
list = ['a','b','c','d']
print(list)

['a', 'b', 'c', 'd']

In [25]:
df_1 = pd.DataFrame(list)
print(df_1)

   0
0  a
1  b
2  c
3  d

In [26]:
df_1

   0
0  a
1  b
2  c
3  d

In [27]:
list_of_list = [[1,2,3],[2,3,4],[3,4,5]]
print(list_of_list)

[[1, 2, 3], [2, 3, 4], [3, 4, 5]]

In [28]:
df_2 = pd.DataFrame(list_of_list)
print(df_2)

   0  1  2
0  1  2  3
1  2  3  4
2  3  4  5

In [29]:
df_2

   0  1  2
0  1  2  3
1  2  3  4
2  3  4  5

In [30]:
dict_1 = {'ID':[11,22,33,44]}
print(dict_1)

{'ID': [11, 22, 33, 44]}

In [31]:
df_3 = pd.DataFrame(dict_1)
df_3

   ID
0  11
1  22
2  33
3  44

In [32]:
dict_2 = {'PIP_NAME': ['Python'],'VERSION':['1.4.2']}
print(dict_2)

{'PIP_NAME': ['Python'], 'VERSION': ['1.4.2']}

In [33]:
df_4 = pd.DataFrame(dict_2)
df_4

  PIP_NAME VERSION
0   Python   1.4.2

# List of Dict

In [34]:
list_dict = [{'a': 1,'b': 2,'c': 3},{'a': 6,'b': 7,'c': 8}]
df_5=pd.DataFrame(list_dict)
df_5

   a  b  c
0  1  2  3
1  6  7  8

In [35]:
list_dict = [{'a': 1,'b': 2,'c': 3},{'a': 6,'b': 7,'c': 8,'d':9}]
df_5=pd.DataFrame(list_dict)
df_5

   a  b  c    d
0  1  2  3  NaN
1  6  7  8  9.0

# Dict of Series

In [36]:
dict_sr = {'ID':pd.Series([1,2,3]),'SN':pd.Series([111,222,333])}
df_6 = pd.DataFrame(dict_sr)
df_6

   ID   SN
0   1  111
1   2  222
2   3  333

# Series

In [37]:
import numpy as np 
sr = pd.Series([1,2,3,np.NaN,4,np.NaN])
sr

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
dtype: float64

In [38]:
sr.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [39]:
sr.isnull().sum()

2

# Merge

In [40]:
df1 = pd.DataFrame({"ID":[1,2,3,4],'Class':[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [42]:
df2 = pd.DataFrame({"ID":[1,2,3,4],'Name':['A','B','C','D']})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [45]:
pd.merge(df1,df2,on = 'ID',how = 'left')
#how = 'right/outer',indicator = True

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [46]:
df3 = pd.DataFrame({'ID': [5,6,7,8],'Name': ['A','B','C','D']})
df3

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

In [47]:
pd.merge(df1,df3,left_index=True,right_index=True)

   ID_x  Class  ID_y Name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D

In [51]:
df2 = pd.DataFrame({"ID":[1,2,3,4],'Class':[9,10,11,12]})
df2

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [52]:
pd.merge(df1,df2,on='ID')

   ID  Class_x  Class_y
0   1        9        9
1   2       10       10
2   3       11       11
3   4       12       12

In [53]:
pd.merge(df1,df2,on='ID',suffixes=('_Higher','_Middle'))

   ID  Class_Higher  Class_Middle
0   1             9             9
1   2            10            10
2   3            11            11
3   4            12            12

# Concat

In [54]:
sr_1 = pd.Series([0,1,2])
sr_1

0    0
1    1
2    2
dtype: int64

In [56]:
sr_2 = pd.Series([3,4,5])
sr_2

0    3
1    4
2    5
dtype: int64

In [58]:
pd.concat([sr_1,sr_2])

0    0
1    1
2    2
0    3
1    4
2    5
dtype: int64

In [59]:
_df1 = pd.DataFrame({"ID":[1,2,3,4],'Name':['A','B','C','D'],'Class':[5,6,7,8]})
_df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [60]:
_df2 = pd.DataFrame({"ID":[5,6,7,8],'Name':['E','F','G','H'],'Class':[9,10,11,12]})
_df2

   ID Name  Class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [61]:
pd.concat([_df1,_df2])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [63]:
pd.concat([_df1,_df2],axis=1)

   ID Name  Class  ID Name  Class
0   1    A      5   5    E      9
1   2    B      6   6    F     10
2   3    C      7   7    G     11
3   4    D      8   8    H     12

In [64]:
pd.concat([_df1,_df2],axis=0,ignore_index=True)

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
4   5    E      9
5   6    F     10
6   7    G     11
7   8    H     12

In [65]:
_df3 = pd.DataFrame({"ID":[1,2,3,4],'Name':['A','B','C','D'],'Class':[5,6,7,8]})
_df3

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [67]:
_df4 = pd.DataFrame({"ID":[3,4],'Name':['C','D'],'Class':[7,8]})
_df4

   ID Name  Class
0   3    C      7
1   4    D      8

In [68]:
pd.concat([_df3,_df4])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   3    C      7
1   4    D      8

In [74]:
pd.concat([_df3,_df4],axis=True,join='inner')

   ID Name  Class  ID Name  Class
0   1    A      5   3    C      7
1   2    B      6   4    D      8

In [76]:
pd.concat([_df1,_df2],keys=['df_first','df_second'])

             ID Name  Class
df_first  0   1    A      5
          1   2    B      6
          2   3    C      7
          3   4    D      8
df_second 0   5    E      9
          1   6    F     10
          2   7    G     11
          3   8    H     12

In [77]:
pd.concat([_df1,_df2],axis=1,keys=['df_first','df_second'])

  df_first            df_second
        ID Name Class        ID Name Class
0        1    A     5         5    E     9
1        2    B     6         6    F    10
2        3    C     7         7    G    11
3        4    D     8         8    H    12

In [78]:
_df5 = pd.DataFrame({"ID":[1,2,3,4],'Name':['A','B','C','D'],'Class':[5,6,7,8]})
_df5

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [79]:
_df6 = pd.DataFrame({'Marks':[63,78,89,97]})
_df6

   Marks
0     63
1     78
2     89
3     97

In [80]:
pd.concat([_df5,_df6])

    ID Name  Class  Marks
0  1.0    A    5.0    NaN
1  2.0    B    6.0    NaN
2  3.0    C    7.0    NaN
3  4.0    D    8.0    NaN
0  NaN  NaN    NaN   63.0
1  NaN  NaN    NaN   78.0
2  NaN  NaN    NaN   89.0
3  NaN  NaN    NaN   97.0

# Join

In [91]:
df__1 = pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df__2 = pd.DataFrame({'c':[4,5,6,7],'D':[40,50,60,70]})

In [92]:
display(df__1,df__2)

   A   B
0  1  10
1  2  20
2  3  30

   c   D
0  4  40
1  5  50
2  6  60
3  7  70

In [93]:
df__1.join(df__2)

   A   B  c   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

# Append

In [98]:
df_1 = pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df_2 = pd.DataFrame({'A':[4,5,6],'B':[40,50,60]})
display(df_1,df_2)

   A   B
0  1  10
1  2  20
2  3  30

   A   B
0  4  40
1  5  50
2  6  60

In [99]:
df_1.append(df_2,ignore_index=True,sort=False)

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
5  6  60